{"pageProps":{"questions":[{"preamble":{"order":1,"title":"What is the Jacobs Alumni Association e.V.?","subtitle":"The Jacobs Alumni Association e.V. is an independent self-organised Association of Jacobs Alumni."},"content":"The Jacobs Alumni Association has existed since the very first class of students graduated in 2004 as an *eingetragener Verein (e.V.) - Registered Association*.\nThe Jacobs Alumni Association e.V. is an independent, non-profit association whose purpose it is to advance education, science and research, including providing support to Jacobs students.\nThe main goal of the Association is to be a steward of the Jacobs University vision and spirit throughout the world and to be able to give back to younger generations with time, expertise and financial resources.\n\nThe Alumni Association consists of:\n- Members (voters)\n- Associated Members (non-voters)\n- General Assembly (GA) (decision-making subset of members at a given time, usually convened at Homecoming every year)\n- Board (representative body that can make certain decisions)\n\nFor full details please see our [Charter](/documents/charter/english/).","filename":"01_what.md"},{"preamble":{"order":2,"title":"Why is the Alumni Association a separate e.V. from the University?","subtitle":"We want the Alumni Association to be independent of the University."},"content":"We believe it is important that the Alumni Association is an organization independent of the University, including an independence of the university's financial, personnel, and strategy decisions.\nThe choice for an e.V. (\"eingetragener Verein\") was made because it bears the lowest fixed legal costs in comparison to other legal forms of clubs (to the best of our knowledge so far).\nLastly, it also allows the Alumni Association to obtain nonprofit status (*Gemeinnüzigkeit*), which is helpful for serving the Association's purpose: acting as stewards of the Jacobs spirit and ensuring that future generations can have the same great Jacobs experience as we did.\n\nPlease see [Figure 1](#figure1) for the ownership structure and relationship between Jacobs University Alumni Association e.V. and other stakeholders.","filename":"02_seperate.md"},{"preamble":{"order":3,"title":"What is the Alumni Board?","subtitle":"We are alumni volunteers!"},"content":"As an independent entity of Jacobs University, the Jacobs Alumni Association e.V. is run by a Board of 8-12 members at any given time.\nWe are very much an operational Board and not a typical supervisory one.\nWe do a lot of small things like replying to your emails, resetting your passwords, posting on Facebook, but also we do a lot of big things like having a permanent seat on the Jacobs Board of Governors, where we participate in shaping Jacobs University's development and strategy!\nTogether with your input, we play a key role in shaping the long-term direction of the University as outlined in the Cooperation Agreement signed by the Association, Jacobs University and the Jacobs Foundation in 2018.\nBut most importantly, we are Jacobs Alumni just like YOU aiming to encourage the growth of our community!\nWe also work very closely with the Alumni Relations Office (ARO) at Jacobs University who help us with day-to-day operations as well as planning and strategy.","filename":"03_board.md"},{"preamble":{"order":4,"title":"Who is a member of the Alumni Association e.V.?","subtitle":"Graduation from Jacobs University does not automatically make an alumnus/alumna a member of the Jacobs Alumni Association e.V."},"content":"Only Jacobs University Alumni and other qualifying individuals (see [Question 5](#q5)) who have submitted a complete application to join the Alumni Association e.V. via our sign-up process and whose application was approved become members of the Association.","filename":"04_whomember.md"},{"preamble":{"order":5,"title":"Why can’t I automatically become a member of the Alumni Association after Graduation?","subtitle":"The Alumni Association is a legal body independent from the University. According to German law (and similar in many other countries), in order to become a member of an association, an act of explicit consent from each individual is required. It is not allowed to force people to be part of an organization or to subscribe them implicitly."},"content":"From the very beginning in 2004, the Jacobs graduates received invitations to sign up for the Alumni Association after Graduation in the form of a registration on the online Alumni Portal “AlmaLink” (superseded by our own [Alumni Portal](https://portal.jacobs-alumni.de) in 2017).\nThe University has always supported the Alumni Association in this process since the membership was connected with the activation of an Alumni Account and the possibility of communicating with Alumni after the end of their studies.\n\nFrom 2017, in order to foster membership growth, the University and the Association designed a new campaign, targeting the third year students in the 6th semester as well as informing all other students during O-Week about the amazing opportunity of being part of the Jacobs Alumni network.\nEven in this case, the students are asked to expressively state their interest to, in the future, be part of the Association and to give their consent to be informed about the Association’s activities, and are e.g. not automatically subscribed to its newsletter.","filename":"05_automember.md"},{"preamble":{"order":6,"title":"How do I become a member of the Alumni Association e.V?","subtitle":"Article 4 of our [Charter](/documents/charter/english/) describes the process of how to become a member of the Alumni Association e.V."},"content":"1. You can apply to become a member at portal.jacobs-alumni.de or provide answers to all the questions in the Alumni Portal via email (we strongly recommend the portal sign-up to provide optimal data security and a fast approval).\n2. The Board will review your application and approve or reject it (so far we have not rejected any complete applications).\n3. Once you receive a confirmation of your membership in writing (via email, for example) your membership starts.","filename":"06_howmember.md"},{"preamble":{"order":7,"title":"What happens if I graduated from Jacobs but I am not a member of the Alumni Association e.V.?","subtitle":"Jacobs University and the Alumni Association are looking forward to cultivating relations with all graduates regardless of their membership status."},"content":"Since the University recognizes the Alumni Association as the official organization of its former students, and the Alumni Association is a shareholder of the University through the Alumni & Friends GmbH, both institutions are committed to supporting each other within a comprehensive cooperation framework (see Figure 1 from the GA 2018 presentation).\n\nIn this regard, they work together, e.g. to foster a broad membership of the Jacobs graduates in the Association, to promote the participation of the Association’s members in events on campus or to offer further dedicated services and benefits.\nTo be sure, the graduates who are currently not members of the Association are invited to join University events such as the Career Fair, Career Symposium or Alumni Homecoming as well as to volunteer in the Mentoring Program or for the activities in Student Marketing, and can benefit from services such as career counselling within the available capacities.","filename":"07_notmember.md"},{"preamble":{"order":8,"title":"Who gets assigned a Jacobs Alumni email address?","subtitle":"Only members of the Jacobs University Alumni Association e.V."},"content":"All Jacobs Alumni are welcome to apply to join the Alumni Association if they fulfil the conditions described in our Charter (see: 4. Who is a Member of the Alumni Association e.V.?).\nAlumni are also welcome to register for the free Starter Tier if they are not able or not willing to contribute to the Association via Contribution Fees.\nThe access to the use of an @jacobs-alumni.de email address is one of the many perks of being a member of the Alumni Association e.V.","filename":"08_howemail.md"},{"preamble":{"order":9,"title":"Is anyone who has a Jacobs Alumni email address a Member of the Alumni Association e.V.?","subtitle":"No. There used to be a lot of Alumni who had Alumni email addresses but they never went through the current application process outlined on the Alumni Portal."},"content":"In the past during the transition of the email management system from Jacobs University IT to the Alumni Association, some alumni might have been assigned an email address but not have gone through a registration process for membership in the Alumni Association.\nWhen Jacobs University IT handed over the email management to the Alumni Association e.V. we got a list of 1,000+ email addresses.\nAt the time, we considered all these email aliases as our members.\nFor most of these entries, we only had names and Graduation Classes.\nWhen we migrated to Google for nonprofits G-Suite, we noticed that the majority of Alumni had never logged into their emails.\n\nTherefore, there was a discrepancy between accounts we had in the Alumni Portal and G-Suite. Not everyone in G-Suite (owners of alumni email addresses) went through the process of registering for the Association in our Alumni Portal.\nTherefore, since some Alumni never did register for the Association or registered long before the current application process, we would kindly ask you to re-confirm your interest in being a member of the Association and re-registering at [portal.jacobs-alumni.de](https://portal.jacobs-alumni.de) so we can consider you a member (and grant you access to your Alumni email address).","filename":"09_noemail.md"},{"preamble":{"order":10,"title":"What are Contribution Fees for Members?","subtitle":"As described in our Charter each member can choose to pay Membership Fees (Contribution Fees)."},"content":"Contribution Fees are based on the following three tiers:\n- Starter - 0 EUR per year for a starting duration of 2 years (after the initial 2-year period elapses, the member will be prompted to choose an alternative tier, Contributor or Patron, or may apply for an 1-year extension of the Starter tier; the extension can be requested repetitively)\n- Contributor - 39 EUR per year - payment details will be collected upon registration and selection of the Contributor tier and if no membership cancellation occurs, the membership contribution fee will be collected annually (after a notification)\n- Patron - 249 EUR per year - payment details will be collected upon registration and selection of the Patron tier and if no membership cancellation occurs, the membership contribution fee will be collected annually (after a notification)\n\nHere is some background and history about the Membership Fees:\n\nIn 2015, following a discussion started in 2008 and a provision existing from the very first version of the Alumni Charter, the Association adopted a fee-based contribution structure for all members, in order to raise more funds and be financially-independent from Jacobs University.\nThis enabled us to have a steady revenue stream to support our operations (database development, tax attorney fees, etc.) and to also give out more scholarships.\nThe changes were supported and voted into force by the Association's General Assembly in September 2015.\nThe implementation of the membership fees was firstly included in the relaunch of AlmaLink in August 2016 and then optimized with the new Membership Portal active from December 2017.\n\nAll revenue from Fundraising and Contribution Fees goes towards the nonprofit purpose of the AA as outlined in our Charter.\nThis happens directly via scholarships, for example, or indirectly through financing the Association’s operations and ensuring its effective work toward fulfilling its purpose and goals.\nAll expenses are independently audited by internal Auditors who are elected from the members and by external tax consultants with whom we submit the financial reports to the authorities.\nThe Annual Financial Report is presented to all members at the annual General Assembly where it is approved as part of the Board's Annual Report.","filename":"10_fees.md"},{"preamble":{"order":11,"title":"Have Contribution Fees made a difference?","subtitle":"Yes, a huge one!"},"content":"In 2018, revenue from Contribution Fees equaled the amount we received from one-time donations from Alumni, therefore, now they account for 50% of our revenue.\nOur Donations and Contribution Fees in 2018 are almost double what Donations alone were in 2015!\nThis is amazing progress in our fundraising efforts only in 3 years.\n\nThe revenue we receive from Contribution Fees and Donations every year now covers our basic running costs but, more importantly, enables us to give out at least one 9,000 EUR scholarship per year consistently for the foreseeable future.\nIn a few years, we might even be able to start giving out two scholarships per year and look into additional Alumni and/or Jacobs-related causes to support.\nBeing able to grant scholarships every year consistently also establishes us as an important stakeholder in the eyes of Jacobs University and gives us more leverage to influence the direction the University will go into in the future.","filename":"11_feesdifference.md"},{"preamble":{"order":12,"title":"Why did the Alumni Association e.V. suspend some email accounts on January 1st, 2019 after all these years?","subtitle":"As the number of Association members started growing exponentially and the Association is continuously becoming more professional, the burden of managing two seperate databases with different membership bases was too large and confusing."},"content":"We want to make sure everyone who has an alumni email address is also a member of the Association, properly registered through the Alumni Portal.\n\nThe need to professionalize and clean up our membership structure was also precipitated by our non-profit status renewal at the end of 2018.\nIn order to make sure all Alumni with alumni email address are registered as members of the Association, we started sending out emails to all @jacobs-alumni.de email addresses we had on file to ask them to (re-)register on the Alumni Portal.\nWe sent out 3 such emails over the span of a few months.\nWe also warned users that their @jacobs-alumni.de email addreses would be suspended on January 1st, 2019 if they had not register on the Alumni Portal by that date.\n\nThe Alumni Portal is a proprietary platform for Membership Management the Association developed.\nThis powerful platform will enable such programs as the Alumni Mentorship program, the Alumni Atlas, and a lot more data-driven projects.\nOf course, the amount of information you wish to fill into your profile and share with others is completely up to you.\nWe simply want to gather reliable data which would enable us to develop features that deliver genuine value for all Alumni.","filename":"12_emailsuspend.md"},{"preamble":{"order":13,"title":"What do I do if I cannot access my email anymore?","subtitle":"We want to sincerely apologize if some of you have been unable to access your emails since January 1st, 2019."},"content":"Maybe we did not manage to communicate clearly enough that access to some email accounts will be suspended on January 1st, 2019.\nWe know that some of you missed the emails we sent out warning you that you need to register by December 31st, 2018 on the Alumni Portal.\nThey were only sent out to affected users to their Alumni accounts which we understand not everyone checks regularly.\nNaturally, we would like to offer you a solution!\n\nThe fastest and easiest thing to do is to head over to portal.jacobs-alumni.de and register.\nYour membership will be confirmed and your email account reactivated as soon as possible.","filename":"13_noaccess.md"},{"preamble":{"order":14,"title":"Is my data lost if I cannot log into my email anymore?","subtitle":"No."},"content":"Your data (emails, Google Drive) is safe, it has not been deleted.","filename":"14_datalost.md"},{"preamble":{"order":15,"title":"How can I get my data back if I don’t want to be a Member of the Association?","subtitle":"You own your data."},"content":"If you do not want to be a member of the Association, we are sorry to hear that and we are happy to grant you temporary access to your Google Apps account for 2 weeks so you can export any data you want.\nPlease email us at [membership@jacobs-alumni.de](mailto:membership@jacobs-alumni.de) with this request.","filename":"15_copy.md"},{"preamble":{"order":16,"title":"Am I being forced to pay for my Alumni email address?","subtitle":"Absolutely not!"},"content":"Your membership contribution is not tied in any way to your email address, but your membership is.\nWe believe membership in the Association should be accessible to all Jacobs Alumni irrespective of their ability to pay the contribution fees.\nTherefore, while we encourage Alumni who have already spent 2 years in the Starter Tier to sign up or upgrade to Contributor (39 EUR/year) or Patron (249 EUR/year), we will ALWAYS have the free membership tier for those who are not able to contribute financially.\n\nWe want to remind you that 100% of all Contribution Fees go either towards supporting Jacobs students with scholarships, who otherwise would not be able to attend Jacobs University, or to help support programs like the Alumni Database, networking programs, tax attorney fees, etc.\nMoreover, as a member, be that Starter, Contributor or Patron, you will have the opportunity to take part in other initiatives such as the Mentorship Program, our annual General Assembly, where we make all decisions for the Association, or enjoy various member benefits.","filename":"16_force.md"},{"preamble":{"order":17,"title":"Do I have to be an active and engaged member of the Association to use the @jacobs-alumni.de email address?","subtitle":"No."},"content":"If you prefer to just check your emails and not participate in any of our other programs like Homecoming, the Mentorship Program, free Career Services, etc., that is up to you.\nHowever, we are very much looking forward to reaching out to you and trying to engage our Alumni base in order to keep building the spirit of Jacobs Alumni beyond our time on campus.\nWe would love to learn from you and try to find new ways of how we can be of value to __YOU__!","filename":"17_active.md"},{"preamble":{"order":18,"title":"How does Jacobs University process alumni data? Why do I receive emails from the University after registering for the Alumni Association, and/or why do I receive emails from the University although I am not a member of the Alumni Association?","subtitle":"As mentioned in the current [Privacy Policy](/documents/privacy/) the data sent to the Association via membership registration (with the exception of payment data) is shared with the Alumni Relations Office at Jacobs University, which is then allowed to further share the information only with the departments of Business Solutions, Student Marketing & Recruitment, Academic Services, Academic Operations, Corporate Services, Campus Operations and Corporate Staff (this happens within the scope of consent granted, inter alia for networking or communication purposes)."},"content":"Neither the Alumni Association nor the Alumni Relations Office nor the other departments are allowed to further share your data with the Student Financial Services department or to third parties outside of the University.\n\nIndependent from the Alumni Association, the University has received contact data from individual Alumni on different occasions.\nThis data is not shared with any third parties outside of the University (including the Alumni Association) without consent.\n\nBecause of the plurality of the actors involved and the implementation of the data protection regulation, it can happen then that an alumnus/a receives communication from the different institutions on the basis of the data currently shared with them.\nFor example, a member of the Alumni Association can receive emails from the Alumni Association, the Alumni Relations Office or the other departments mentioned above because of the contact details collected by the Alumni Association; on the other hand, he or she may also receive emails from Student Financial Services in the case there is an open communication with them, even though the Alumni Relations Office and the Alumni Association are not informed in any way about that.\n\nSimilarly, a non-member does not receive communication provided by the Alumni Association or the Alumni Relations Office, but he or she might be independently in touch with the University because of his or her correspondence with another department (e.g. Student Financial Services).","filename":"18_privacy.md"}]},"__N_SSG":true}